; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_4 ?v5 - type_1 ?v6 - type_3)
 	      (pred_2 ?v4 - object ?v6 - type_3)
	      (pred_3 ?v5 - type_1 ?v1 - type_2)
	      (pred_1 ?v5 - type_1 ?v4 - object ?v1 - type_2))

   (:action op_1
       :parameters  (?v5 - type_1 ?v2 ?v3 - type_3)
       :precondition (and  (pred_4 ?v5 ?v2))
       :effect (and  (pred_4 ?v5 ?v3)
		     (not (pred_4 ?v5 ?v2))))

   (:action op_2
       :parameters (?v5 - type_1 ?v7 - object ?v8 - type_3 ?v1 - type_2)
       :precondition  (and  (pred_2 ?v7 ?v8) (pred_4 ?v5 ?v8) (pred_3 ?v5 ?v1))
       :effect (and (pred_1 ?v5 ?v7 ?v1)
		    (not (pred_2 ?v7 ?v8)) 
		    (not (pred_3 ?v5 ?v1))))

   (:action op_3
       :parameters (?v5 - type_1 ?v7 - object ?v8 - type_3 ?v1 - type_2)
       :precondition  (and  (pred_1 ?v5 ?v7 ?v1) (pred_4 ?v5 ?v8))
       :effect (and (pred_2 ?v7 ?v8)
		    (pred_3 ?v5 ?v1)
		    (not (pred_1 ?v5 ?v7 ?v1)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_11 obj_06 - type_1
obj_08 obj_09 obj_12 obj_14 - type_2
obj_04 obj_10 obj_13 obj_02 - type_3
obj_05 obj_07 obj_03 obj_01 - object)
(:init
(pred_4 obj_11 obj_13)
(pred_3 obj_11 obj_08)
(pred_3 obj_11 obj_09)
(pred_4 obj_06 obj_10)
(pred_3 obj_06 obj_12)
(pred_3 obj_06 obj_14)
(pred_2 obj_05 obj_10)
(pred_2 obj_07 obj_10)
(pred_2 obj_03 obj_04)
(pred_2 obj_01 obj_02)
)
(:goal
(and
(pred_2 obj_05 obj_10)
(pred_2 obj_07 obj_13)
(pred_2 obj_03 obj_02)
(pred_2 obj_01 obj_10)
)
)

(:constraints
  (always (not (pred_4 obj_11 obj_02)))
)
)

; plan
1. (op_1 obj_11 obj_13 obj_04)
   deleted: (pred_4 obj_11 obj_13)
   added: (pred_4 obj_11 obj_04)
   goals met: 1 of 4
2. (op_2 obj_06 obj_07 obj_10 obj_14)
   deleted: (pred_2 obj_07 obj_10) (pred_3 obj_06 obj_14)
   added: (pred_1 obj_06 obj_07 obj_14)
   goals met: 1 of 4
3. (op_1 obj_06 obj_10 obj_13)
   deleted: (pred_4 obj_06 obj_10)
   added: (pred_4 obj_06 obj_13)
   goals met: 1 of 4
4. (op_2 obj_11 obj_03 obj_04 obj_09)
   deleted: (pred_2 obj_03 obj_04) (pred_3 obj_11 obj_09)
   added: (pred_1 obj_11 obj_03 obj_09)
   goals met: 1 of 4
5. (op_3 obj_06 obj_07 obj_13 obj_14)
   deleted: (pred_1 obj_06 obj_07 obj_14)
   added: (pred_2 obj_07 obj_13) (pred_3 obj_06 obj_14)
   goals met: 2 of 4
6. (op_1 obj_11 obj_04 obj_10)
   deleted: (pred_4 obj_11 obj_04)
   added: (pred_4 obj_11 obj_10)
   goals met: 2 of 4
7. (op_1 obj_06 obj_13 obj_04)
   deleted: (pred_4 obj_06 obj_13)
   added: (pred_4 obj_06 obj_04)
   goals met: 2 of 4
8. (op_3 obj_11 obj_03 obj_10 obj_09)
   deleted: (pred_1 obj_11 obj_03 obj_09)
   added: (pred_2 obj_03 obj_10) (pred_3 obj_11 obj_09)
   goals met: 2 of 4
9. (op_1 obj_06 obj_04 obj_02)
   deleted: (pred_4 obj_06 obj_04)
   added: (pred_4 obj_06 obj_02)
   goals met: 2 of 4
10. (op_2 obj_06 obj_01 obj_02 obj_14)
   deleted: (pred_2 obj_01 obj_02) (pred_3 obj_06 obj_14)
   added: (pred_1 obj_06 obj_01 obj_14)
   goals met: 2 of 4
11. (op_1 obj_06 obj_02 obj_10)
   deleted: (pred_4 obj_06 obj_02)
   added: (pred_4 obj_06 obj_10)
   goals met: 2 of 4
12. (op_3 obj_06 obj_01 obj_10 obj_14)
   deleted: (pred_1 obj_06 obj_01 obj_14)
   added: (pred_2 obj_01 obj_10) (pred_3 obj_06 obj_14)
   goals met: 3 of 4
13. (op_2 obj_06 obj_03 obj_10 obj_14)
   deleted: (pred_2 obj_03 obj_10) (pred_3 obj_06 obj_14)
   added: (pred_1 obj_06 obj_03 obj_14)
   goals met: 3 of 4
14. (op_1 obj_06 obj_10 obj_02)
   deleted: (pred_4 obj_06 obj_10)
   added: (pred_4 obj_06 obj_02)
   goals met: 3 of 4
15. (op_3 obj_06 obj_03 obj_02 obj_14)
   deleted: (pred_1 obj_06 obj_03 obj_14)
   added: (pred_2 obj_03 obj_02) (pred_3 obj_06 obj_14)
   goals met: 4 of 4
